## Data

In [1]:
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

### Belirli Bir Sütuna Göre Sıralamak

In [4]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [5]:
student_df.sort_values(by="age")

     name last_name  age  student_number
1  Andrew   Bradley   21             403
0  Finley     Brown   23             101
3   Denis     James   24               1
2   Blake    Hughes   34             202

In [6]:
df2 = student_df.sort_values(by="name")

In [20]:
df2

     name last_name  age  student_number
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1
0  Finley     Brown   23             101

In [21]:
student_df.sort_values(by="age")

     name last_name  age  student_number
1  Andrew   Bradley   21             403
0  Finley     Brown   23             101
3   Denis     James   24               1
2   Blake    Hughes   34             202

In [22]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [23]:
student_df.sort_values(by="age", ascending=False)

     name last_name  age  student_number
2   Blake    Hughes   34             202
3   Denis     James   24               1
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403

In [14]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [25]:
student_df.at[1, "last_name"] = "Brown"

In [26]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [27]:
df2 = student_df.sort_values(by=["last_name"])

In [28]:
df2

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [16]:
# İlk last_name e göre sıralayıp last_name i aynı olanlarda name e bakarak sıralayacak
student_df.sort_values(by=["last_name", "name"])

     name last_name  age  student_number
1  Andrew     Brown   21             403
0  Finley     Brown   23             101
2   Blake    Hughes   34             202
3   Denis     James   24               1

### Birden Fazla Sütuna Göre Sıralarken Birine Göre Artan Birine Göre Azalan Sıralamak

In [17]:
student_df.sort_values(by=["last_name", "name"], ascending=[True,False]) #burada last name göre bakar orda birşey tespit edemezsse name a bakar.

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

### Series Objelerini Sıralamak

In [18]:
student_df["name"]

0    Finley
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [19]:
student_df["name"].sort_values()

1    Andrew
2     Blake
3     Denis
0    Finley
Name: name, dtype: object